<?php

namespace App\Console\Commands;

use DB;
use Illuminate\Console\Command;

class CreditSummaryInsert extends Command
{

    protected $signature = 'CreditSummaryInsert';

    protected $description = 'Command description';

    public function handle()
    {

//===============================================//
$str2 = "
1	アメトーーククラブ
2	ソフトバンク
3	マイクロソフト
4	任天堂
5	テラサ
6	AWS
7	Hulu
8	FOD
9	ABEMA
10	投資
11	グーグルクラウド
12	アドビ
14	さくらインターネット
15	グーグルプレイアップ
16	テレビ東京
17	ドコモ
18	東京電力
19	NTTコミュニケーション
20	ユーネクスト
21	データ便
22	ネットフリックス
23	paddle
24	パラビ
25	エイワスポーツジム
26	chatgpt
27	アーバンコーポレーション
28	ユーチューブ
29	NTTドコモビジネス
30	chatgpt
";


$ex_str2 = explode("\n", $str2);

$subscriptionItems = [];

foreach ($ex_str2 as $k2 => $v2) {
    if (trim($v2) == "") {
        continue;
    }

    $ex_v2 = explode("\t", trim($v2));

    $subscriptionItems[trim($ex_v2[1])] = "";
}

//===============================================//



$str = "
1578	2026-02	2026-02-05	1644	2025-12-26	不明	NTTドコモビジネス	334
1579	2026-02	2026-02-05	1644	2026-01-01	不明	MONGODB	1310
1718	2026-02	2026-02-26	10281	2026-01-20	雑費	アマゾン	599
1720	2026-02	2026-02-26	10281	2026-01-29	雑費	アマゾン	650
1719	2026-02	2026-02-26	10281	2026-01-25	雑費	アマゾン	820
1717	2026-02	2026-02-26	10281	2026-01-19	雑費	アマゾン	1227
1716	2026-02	2026-02-26	10281	2026-01-15	雑費	アマゾン	1996
1715	2026-02	2026-02-26	10281	2026-01-02	雑費	アマゾン	2800
1714	2026-02	2026-02-26	10281	2026-01-01	遊興費	ユーネクスト	2189
1711	2026-02	2026-02-27	7962	2026-01-12	雑費	TEMU	2958
1713	2026-02	2026-02-27	7962	2025-12-31	通信費	ソフトバンク	3964
1712	2026-02	2026-02-27	7962	2025-12-31	通信費	ソフトバンク	1040
1675	2026-02	2026-02-27	50588	2025-12-28	楽天キャッシュ	楽天キャッシュ	4138
1676	2026-02	2026-02-27	50588	2025-12-31	楽天キャッシュ	楽天キャッシュ	1000
1677	2026-02	2026-02-27	50588	2026-01-14	投資	投資	26667
1678	2026-02	2026-02-27	50588	2026-01-19	楽天キャッシュ	楽天キャッシュ	5719
1679	2026-02	2026-02-27	50588	2026-01-25	楽天キャッシュ	楽天キャッシュ	4540
1673	2026-02	2026-02-27	50588	2026-01-06	楽天キャッシュ	楽天キャッシュ	5413
1674	2026-02	2026-02-27	50588	2026-01-13	楽天キャッシュ	楽天キャッシュ	3111
1704	2026-02	2026-02-27	135582	2026-01-19	設備費	アドビ	1780
1706	2026-02	2026-02-27	135582	2026-01-23	遊興費	ユーチューブ	1280
1707	2026-02	2026-02-27	135582	2026-01-14	遊興費	FOD	1320
1708	2026-02	2026-02-27	135582	2026-01-28	設備費	グーグルプレイアップ	290
1709	2026-02	2026-02-27	135582	2026-01-29	設備費	さくらインターネット	1925
1710	2026-02	2026-02-27	135582	2026-01-31	設備費	chatgpt	3543
1695	2026-02	2026-02-27	135582	2026-01-15	遊興費	ネットフリックス	1590
1705	2026-02	2026-02-27	135582	2026-01-20	設備費	マイクロソフト	2130
1703	2026-02	2026-02-27	135582	2026-01-16	投資	投資	100000
1702	2026-02	2026-02-27	135582	2026-01-15	支払い	アーバンコーポレーション	7260
1701	2026-02	2026-02-27	135582	2026-01-25	交通費	モバイルスイカ	10000
1700	2026-02	2026-02-27	135582	2026-01-11	遊興費	Hulu	1026
1699	2026-02	2026-02-27	135582	2026-01-09	遊興費	ABEMA	1080
1698	2026-02	2026-02-27	135582	2026-01-06	雑費	楽天市場	598
1697	2026-02	2026-02-27	135582	2026-01-01	遊興費	テラサ	990
1696	2026-02	2026-02-27	135582	2026-01-01	遊興費	アメトーーククラブ	770
";

        $ex_str = explode("\n", $str);

        $flag = true;
        foreach ($ex_str as $k => $v) {
            if (trim($v) == "") {
                continue;
            }

            $ex_v = explode("\t", trim($v));

            list($year, $month) = explode("-", trim($ex_v[1]));

            if($flag){
                DB::table('t_credit_summary')->where('year', '=', $year)->where('month', '=', $month)->delete();
                $flag = false;
            }

$subscription = (isset($subscriptionItems[trim($ex_v[6])]))? 1:0;

            $insert = [
                "year" => $year,
                "month" => $month,

                "use_date" => trim($ex_v[4]),
                "item" => trim($ex_v[5]),
                "detail" => trim($ex_v[6]),
                "price" => trim($ex_v[7]),
                "subscription" => $subscription
            ];

print_r($insert);
echo "\n\n";

            DB::table('t_credit_summary')->insert($insert);
        }

    }
}
