<?php

namespace App\Console\Commands;

use DB;
use Illuminate\Console\Command;

class CreditSummaryInsert extends Command
{

    protected $signature = 'CreditSummaryInsert';

    protected $description = 'Command description';

    public function handle()
    {

$str = "
1161	2025-10	2025-10-06	334	2025-08-26	不明	NTTドコモビジネス	334
1267	2025-10	2025-10-27	8660	2025-08-31	通信費	ソフトバンク	6698
1265	2025-10	2025-10-27	8660	2025-09-18	雑費	TEMU	1430
1266	2025-10	2025-10-27	8660	2025-09-13	教育費	コインスペース	532
1234	2025-10	2025-10-27	59537	2025-09-09	楽天キャッシュ	楽天キャッシュ	5773
1235	2025-10	2025-10-27	59537	2025-09-14	投資	投資	26667
1236	2025-10	2025-10-27	59537	2025-09-15	雑費	アマゾン	1342
1237	2025-10	2025-10-27	59537	2025-09-23	楽天キャッシュ	楽天キャッシュ	6774
1238	2025-10	2025-10-27	59537	2025-09-02	楽天キャッシュ	楽天キャッシュ	5138
1239	2025-10	2025-10-27	59537	2025-09-15	楽天キャッシュ	楽天キャッシュ	1000
1240	2025-10	2025-10-27	59537	2025-09-17	楽天キャッシュ	楽天キャッシュ	6205
1241	2025-10	2025-10-27	59537	2025-08-27	楽天キャッシュ	楽天キャッシュ	6638
1296	2025-10	2025-10-27	28716	2025-09-13	遊興費	TOHOシネマズ	2000
1299	2025-10	2025-10-27	28716	2025-09-27	雑費	アマゾン	6069
1302	2025-10	2025-10-27	28716	2025-09-15	雑費	アマゾン	500
1301	2025-10	2025-10-27	28716	2025-09-30	教育費	UDEMY	3600
1293	2025-10	2025-10-27	28716	2025-09-01	雑費	アマゾン	980
1294	2025-10	2025-10-27	28716	2025-09-11	教育費	UDEMY	3600
1295	2025-10	2025-10-27	28716	2025-09-12	教育費	UDEMY	2600
1300	2025-10	2025-10-27	28716	2025-09-28	雑費	アマゾン	2668
1297	2025-10	2025-10-27	28716	2025-09-14	雑費	アマゾン	799
1298	2025-10	2025-10-27	28716	2025-09-22	遊興費	アマゾン	5900
1323	2025-10	2025-10-27	134456	2025-09-11	遊興費	Hulu	1026
1321	2025-10	2025-10-27	134456	2025-09-01	遊興費	アメトーーククラブ	770
1335	2025-10	2025-10-27	134456	2025-09-16	投資	投資	100000
1334	2025-10	2025-10-27	134456	2025-09-28	設備費	グーグルプレイアップ	290
1333	2025-10	2025-10-27	134456	2025-09-27	設備費	さくらインターネット	1925
1332	2025-10	2025-10-27	134456	2025-09-23	遊興費	ユーチューブ	1280
1331	2025-10	2025-10-27	134456	2025-09-20	設備費	マイクロソフト	2130
1330	2025-10	2025-10-27	134456	2025-09-19	設備費	アドビ	1780
1329	2025-10	2025-10-27	134456	2025-09-30	設備費	chatgpt	3359
1328	2025-10	2025-10-27	134456	2025-09-15	遊興費	ネットフリックス	1590
1327	2025-10	2025-10-27	134456	2025-09-14	設備費	グーグルプレイアップ	976
1326	2025-10	2025-10-27	134456	2025-09-18	交通費	モバイルスイカ	10000
1325	2025-10	2025-10-27	134456	2025-09-01	遊興費	テラサ	990
1324	2025-10	2025-10-27	134456	2025-09-15	設備費	アーバンコーポレーション	7260
1322	2025-10	2025-10-27	134456	2025-09-09	遊興費	ABEMA	1080
";

        $ex_str = explode("\n", $str);

        $flag = true;
        foreach ($ex_str as $k => $v) {
            if (trim($v) == "") {
                continue;
            }

            $ex_v = explode("\t", trim($v));

            list($year, $month) = explode("-", trim($ex_v[1]));

            if($flag){
                DB::table('t_credit_summary')->where('year', '=', $year)->where('month', '=', $month)->delete();
                $flag = false;
            }

            $insert = [
                "year" => $year,
                "month" => $month,

                "use_date" => trim($ex_v[4]),
                "item" => trim($ex_v[5]),
                "detail" => trim($ex_v[6]),
                "price" => trim($ex_v[7])
            ];

print_r($insert);
echo "\n\n";

            DB::table('t_credit_summary')->insert($insert);
        }




/*


create table t_credit_summary(
id int primary key auto_increment,
year text,
month text,
use_date text,
item text,
detail text,
price int
);



*/




    }
}
