<?php

namespace App\Console\Commands;

use DB;
use Illuminate\Console\Command;

class CreditSummaryInsert extends Command
{

    protected $signature = 'CreditSummaryInsert';

    protected $description = 'Command description';

    public function handle()
    {

$str = "
1381	2025-12	2025-12-05	334	2025-10-26	不明	NTTドコモビジネス	334
1557	2025-12	2025-12-26	12473	2025-11-18	教育費	udemy	400
1554	2025-12	2025-12-26	12473	2025-11-24	雑費	アマゾン	1227
1553	2025-12	2025-12-26	12473	2025-11-24	雑費	アマゾン	4227
1552	2025-12	2025-12-26	12473	2025-11-11	雑費	アマゾン	799
1551	2025-12	2025-12-26	12473	2025-11-08	雑費	アマゾン	2809
1555	2025-12	2025-12-26	12473	2025-11-27	雑費	アマゾン	686
1550	2025-12	2025-12-26	12473	2025-11-07	雑費	アマゾン	1280
1556	2025-12	2025-12-26	12473	2025-11-28	雑費	アマゾン	1045
1559	2025-12	2025-12-29	6951	2025-11-24	お線香代	願泉寺	22
1558	2025-12	2025-12-29	6951	2025-10-31	通信費	ソフトバンク	6929
1438	2025-12	2025-12-29	43466	2025-11-09	楽天キャッシュ	楽天キャッシュ	4504
1439	2025-12	2025-12-29	43466	2025-11-14	楽天キャッシュ	楽天キャッシュ	26667
1440	2025-12	2025-12-29	43466	2025-11-18	楽天キャッシュ	楽天キャッシュ	6779
1437	2025-12	2025-12-29	43466	2025-10-31	楽天キャッシュ	楽天キャッシュ	4366
1436	2025-12	2025-12-29	43466	2025-11-23	楽天キャッシュ	楽天キャッシュ	1150
1460	2025-12	2025-12-29	136293	2025-11-15	支払い	アーバンコーポレーション	7260
1467	2025-12	2025-12-29	136293	2025-11-24	交通費	モバイルスイカ	10000
1468	2025-12	2025-12-29	136293	2025-11-26	設備費	グーグルプレイアップ	1300
1469	2025-12	2025-12-29	136293	2025-11-28	設備費	さくらインターネット	1925
1470	2025-12	2025-12-29	136293	2025-11-28	設備費	グーグルプレイアップ	290
1471	2025-12	2025-12-29	136293	2025-11-30	設備費	chatgpt	3552
1456	2025-12	2025-12-29	136293	2025-11-01	遊興費	アメトーーククラブ	770
1466	2025-12	2025-12-29	136293	2025-11-23	遊興費	ユーチューブ	1280
1465	2025-12	2025-12-29	136293	2025-11-20	設備費	マイクロソフト	2130
1464	2025-12	2025-12-29	136293	2025-11-19	設備費	アドビ	1780
1463	2025-12	2025-12-29	136293	2025-11-16	投資	投資	100000
1462	2025-12	2025-12-29	136293	2025-11-15	設備費	グーグルプレイアップ	1320
1461	2025-12	2025-12-29	136293	2025-11-15	遊興費	ネットフリックス	1590
1459	2025-12	2025-12-29	136293	2025-11-09	遊興費	ABEMA	1080
1458	2025-12	2025-12-29	136293	2025-11-11	遊興費	Hulu	1026
1457	2025-12	2025-12-29	136293	2025-11-01	遊興費	テラサ	990
";

        $ex_str = explode("\n", $str);

        $flag = true;
        foreach ($ex_str as $k => $v) {
            if (trim($v) == "") {
                continue;
            }

            $ex_v = explode("\t", trim($v));

            list($year, $month) = explode("-", trim($ex_v[1]));

            if($flag){
                DB::table('t_credit_summary')->where('year', '=', $year)->where('month', '=', $month)->delete();
                $flag = false;
            }

            $insert = [
                "year" => $year,
                "month" => $month,

                "use_date" => trim($ex_v[4]),
                "item" => trim($ex_v[5]),
                "detail" => trim($ex_v[6]),
                "price" => trim($ex_v[7])
            ];

print_r($insert);
echo "\n\n";

            DB::table('t_credit_summary')->insert($insert);
        }




/*


create table t_credit_summary(
id int primary key auto_increment,
year text,
month text,
use_date text,
item text,
detail text,
price int
);



*/




    }
}
