<?php

namespace App\Console\Commands;

use DB;
use Illuminate\Console\Command;

class CreditSummaryInsert extends Command
{

    protected $signature = 'CreditSummaryInsert';

    protected $description = 'Command description';

    public function handle()
    {

//===============================================//
$str2 = "
1	アメトーーククラブ
2	ソフトバンク
3	マイクロソフト
4	任天堂
5	テラサ
6	AWS
7	Hulu
8	FOD
9	ABEMA
10	投資
11	グーグルクラウド
12	アドビ
14	さくらインターネット
15	グーグルプレイアップ
16	テレビ東京
17	ドコモ
18	東京電力
19	NTTコミュニケーション
20	ユーネクスト
21	データ便
22	ネットフリックス
23	paddle
24	パラビ
25	エイワスポーツジム
26	chatgpt
27	アーバンコーポレーション
28	ユーチューブ
29	NTTドコモビジネス
30	chatgpt
";


$ex_str2 = explode("\n", $str2);

$subscriptionItems = [];

foreach ($ex_str2 as $k2 => $v2) {
    if (trim($v2) == "") {
        continue;
    }

    $ex_v2 = explode("\t", trim($v2));

    $subscriptionItems[trim($ex_v2[1])] = "";
}

//===============================================//



$str = "
1561	2026-01	2026-01-05	705	2025-12-01	不明	モンゴDB	371
1560	2026-01	2026-01-05	705	2025-11-26	不明	NTTドコモビジネス	334
1626	2026-01	2026-01-26	16828	2025-12-23	雑費	アマゾン	3680
1627	2026-01	2026-01-26	16828	2025-12-30	遊興費	TOHOシネマズ	4000
1625	2026-01	2026-01-26	16828	2025-12-18	雑費	アマゾン	1423
1624	2026-01	2026-01-26	16828	2025-12-11	雑費	アマゾン	1398
1623	2026-01	2026-01-26	16828	2025-12-06	雑費	アマゾン	1188
1622	2026-01	2026-01-26	16828	2025-12-04	雑費	アマゾン	141
1621	2026-01	2026-01-26	16828	2025-12-01	雑費	アマゾン	2809
1620	2026-01	2026-01-26	16828	2025-12-01	遊興費	ユーネクスト	2189
1533	2026-01	2026-01-27	55688	2025-12-21	楽天キャッシュ	楽天キャッシュ	3560
1534	2026-01	2026-01-27	55688	2025-12-24	楽天キャッシュ	楽天キャッシュ	4499
1528	2026-01	2026-01-27	55688	2025-11-26	楽天キャッシュ	楽天キャッシュ	3519
1532	2026-01	2026-01-27	55688	2025-12-18	楽天キャッシュ	楽天キャッシュ	8034
1531	2026-01	2026-01-27	55688	2025-12-14	楽天キャッシュ	楽天キャッシュ	26667
1530	2026-01	2026-01-27	55688	2025-12-12	楽天キャッシュ	楽天キャッシュ	3668
1529	2026-01	2026-01-27	55688	2025-12-04	楽天キャッシュ	楽天キャッシュ	5741
1604	2026-01	2026-01-27	27039	2025-12-24	雑費	TEMU	2415
1608	2026-01	2026-01-27	27039	2025-11-30	通信費	ソフトバンク	6540
1607	2026-01	2026-01-27	27039	2025-11-30	通信費	ソフトバンク	4998
1606	2026-01	2026-01-27	27039	2025-12-16	雑費	TEMU	8429
1605	2026-01	2026-01-27	27039	2025-12-24	雑費	TEMU	4657
1573	2026-01	2026-01-27	136739	2025-12-31	設備費	chatgpt	3578
1576	2026-01	2026-01-27	136739	2025-12-30	交通費	モバイルスイカ	10000
1577	2026-01	2026-01-27	136739	2025-12-16	投資	投資	100000
1562	2026-01	2026-01-27	136739	2025-12-01	遊興費	テラサ	990
1575	2026-01	2026-01-27	136739	2025-12-28	設備費	グーグルプレイアップ	290
1574	2026-01	2026-01-27	136739	2025-12-26	設備費	さくらインターネット	1925
1572	2026-01	2026-01-27	136739	2025-12-15	支払い	アーバンコーポレーション	7260
1571	2026-01	2026-01-27	136739	2025-12-14	遊興費	FOD	1320
1570	2026-01	2026-01-27	136739	2025-12-23	遊興費	ユーチューブ	1280
1569	2026-01	2026-01-27	136739	2025-12-20	設備費	マイクロソフト	2130
1568	2026-01	2026-01-27	136739	2025-12-19	設備費	アドビ	1780
1567	2026-01	2026-01-27	136739	2025-12-01	遊興費	アメトーーククラブ	770
1566	2026-01	2026-01-27	136739	2025-12-15	遊興費	ネットフリックス	1590
1565	2026-01	2026-01-27	136739	2025-12-11	遊興費	Hulu	1026
1564	2026-01	2026-01-27	136739	2025-12-09	遊興費	ABEMA	1080
1563	2026-01	2026-01-27	136739	2025-12-09	雑費	楽天市場	1720
";

        $ex_str = explode("\n", $str);

        $flag = true;
        foreach ($ex_str as $k => $v) {
            if (trim($v) == "") {
                continue;
            }

            $ex_v = explode("\t", trim($v));

            list($year, $month) = explode("-", trim($ex_v[1]));

            if($flag){
                DB::table('t_credit_summary')->where('year', '=', $year)->where('month', '=', $month)->delete();
                $flag = false;
            }

$subscription = (isset($subscriptionItems[trim($ex_v[6])]))? 1:0;

            $insert = [
                "year" => $year,
                "month" => $month,

                "use_date" => trim($ex_v[4]),
                "item" => trim($ex_v[5]),
                "detail" => trim($ex_v[6]),
                "price" => trim($ex_v[7]),
                "subscription" => $subscription
            ];

print_r($insert);
echo "\n\n";

            DB::table('t_credit_summary')->insert($insert);
        }

    }
}
