<?php

namespace App\Console\Commands;

use DB;
use Illuminate\Console\Command;

class CreditSummaryInsert extends Command
{

    protected $signature = 'CreditSummaryInsert';

    protected $description = 'Command description';

    public function handle()
    {

$str = "
1264	2025-11	2025-11-05	334	2025-09-26	不明	NTTドコモビジネス	334
1419	2025-11	2025-11-26	8867	2025-10-23	雑費	アマゾン	1796
1421	2025-11	2025-11-26	8867	2025-10-30	雑費	アマゾン	1815
1418	2025-11	2025-11-26	8867	2025-10-15	雑費	アマゾン	2781
1420	2025-11	2025-11-26	8867	2025-10-23	雑費	アマゾン	1227
1417	2025-11	2025-11-26	8867	2025-10-06	雑費	アマゾン	1248
1351	2025-11	2025-11-27	55757	2025-10-15	楽天キャッシュ	楽天キャッシュ	5976
1352	2025-11	2025-11-27	55757	2025-10-20	楽天キャッシュ	楽天キャッシュ	4039
1353	2025-11	2025-11-27	55757	2025-10-24	楽天キャッシュ	楽天キャッシュ	3956
1354	2025-11	2025-11-27	55757	2025-09-29	楽天キャッシュ	楽天キャッシュ	6025
1355	2025-11	2025-11-27	55757	2025-10-08	楽天キャッシュ	楽天キャッシュ	9094
1356	2025-11	2025-11-27	55757	2025-10-14	楽天キャッシュ	楽天キャッシュ	26667
1365	2025-11	2025-11-27	136157	2025-10-16	投資	投資	100000
1360	2025-11	2025-11-27	136157	2025-10-01	遊興費	アメトーーククラブ	770
1361	2025-11	2025-11-27	136157	2025-10-11	遊興費	Hulu	1026
1362	2025-11	2025-11-27	136157	2025-10-14	設備費	グーグルプレイアップ	976
1363	2025-11	2025-11-27	136157	2025-10-15	遊興費	ネットフリックス	1590
1364	2025-11	2025-11-27	136157	2025-10-15	支払い	アーバンコーポレーション	7260
1357	2025-11	2025-11-27	136157	2025-10-08	雑費	楽天市場	1540
1366	2025-11	2025-11-27	136157	2025-10-18	交通費	モバイルスイカ	10000
1367	2025-11	2025-11-27	136157	2025-10-19	設備費	アドビ	1780
1368	2025-11	2025-11-27	136157	2025-10-20	設備費	マイクロソフト	2130
1369	2025-11	2025-11-27	136157	2025-10-23	遊興費	ユーチューブ	1280
1370	2025-11	2025-11-27	136157	2025-10-28	設備費	グーグルプレイアップ	290
1371	2025-11	2025-11-27	136157	2025-10-30	設備費	さくらインターネット	1925
1372	2025-11	2025-11-27	136157	2025-10-31	設備費	chatgpt	3520
1358	2025-11	2025-11-27	136157	2025-10-09	遊興費	ABEMA	1080
1359	2025-11	2025-11-27	136157	2025-10-01	遊興費	テラサ	990
1282	2025-11	2025-11-27	13092	2025-09-30	通信費	ソフトバンク	6874
1280	2025-11	2025-11-27	13092	2025-10-04	雑費	TEMU	2889
1281	2025-11	2025-11-27	13092	2025-10-04	雑費	TEMU	3329
";

        $ex_str = explode("\n", $str);

        $flag = true;
        foreach ($ex_str as $k => $v) {
            if (trim($v) == "") {
                continue;
            }

            $ex_v = explode("\t", trim($v));

            list($year, $month) = explode("-", trim($ex_v[1]));

            if($flag){
                DB::table('t_credit_summary')->where('year', '=', $year)->where('month', '=', $month)->delete();
                $flag = false;
            }

            $insert = [
                "year" => $year,
                "month" => $month,

                "use_date" => trim($ex_v[4]),
                "item" => trim($ex_v[5]),
                "detail" => trim($ex_v[6]),
                "price" => trim($ex_v[7])
            ];

print_r($insert);
echo "\n\n";

            DB::table('t_credit_summary')->insert($insert);
        }




/*


create table t_credit_summary(
id int primary key auto_increment,
year text,
month text,
use_date text,
item text,
detail text,
price int
);



*/




    }
}
