<?php

namespace App\Console\Commands;

use DB;
use Illuminate\Console\Command;

class CreditSummaryInsert extends Command
{

    protected $signature = 'CreditSummaryInsert';

    protected $description = 'Command description';

    public function handle()
    {

//===============================================//
$str2 = "
1	アメトーーククラブ
2	ソフトバンク
3	マイクロソフト
4	任天堂
5	テラサ
6	AWS
7	Hulu
8	FOD
9	ABEMA
10	投資
11	グーグルクラウド
12	アドビ
14	さくらインターネット
15	グーグルプレイアップ
16	テレビ東京
17	ドコモ
18	東京電力
19	NTTコミュニケーション
20	ユーネクスト
21	データ便
22	ネットフリックス
23	paddle
24	パラビ
25	エイワスポーツジム
26	chatgpt
27	アーバンコーポレーション
28	ユーチューブ
29	NTTドコモビジネス
30	chatgpt
";


$ex_str2 = explode("\n", $str2);

$subscriptionItems = [];

foreach ($ex_str2 as $k2 => $v2) {
    if (trim($v2) == "") {
        continue;
    }

    $ex_v2 = explode("\t", trim($v2));

    $subscriptionItems[trim($ex_v2[1])] = "";
}

//===============================================//



$str = "
1964	2026-05	2026-05-06	4800	2026-03-29	設備費	クロードコード	3318
1963	2026-05	2026-05-06	4800	2026-04-01	不明	MONGODB	1149
1965	2026-05	2026-05-06	4800	2026-03-26	不明	NTTドコモビジネス	333
2055	2026-05	2026-05-26	3775	2026-04-18	雑費	アマゾン	498
2054	2026-05	2026-05-26	3775	2026-04-11	雑費	アマゾン	1497
2053	2026-05	2026-05-26	3775	2026-04-04	雑費	アマゾン	1780
2097	2026-05	2026-05-27	7159	2026-04-03	遊興費	ディズニープラス	1670
2096	2026-05	2026-05-27	7159	2026-03-31	通信費	ソフトバンク	1040
2095	2026-05	2026-05-27	7159	2026-03-31	通信費	ソフトバンク	4449
2010	2026-05	2026-05-27	54382	2026-04-13	楽天キャッシュ	楽天キャッシュ	1000
2011	2026-05	2026-05-27	54382	2026-04-19	楽天キャッシュ	楽天キャッシュ	9777
2012	2026-05	2026-05-27	54382	2026-04-22	楽天キャッシュ	楽天キャッシュ	1000
2013	2026-05	2026-05-27	54382	2026-04-09	楽天キャッシュ	楽天キャッシュ	7326
2014	2026-05	2026-05-27	54382	2026-04-10	楽天キャッシュ	楽天キャッシュ	1000
2015	2026-05	2026-05-27	54382	2026-04-14	楽天キャッシュ	楽天キャッシュ	26335
2016	2026-05	2026-05-27	54382	2026-04-15	楽天キャッシュ	楽天キャッシュ	1000
2017	2026-05	2026-05-27	54382	2026-03-31	楽天キャッシュ	楽天キャッシュ	5944
2018	2026-05	2026-05-27	54382	2026-04-07	楽天キャッシュ	楽天キャッシュ	1000
2039	2026-05	2026-05-27	164541	2026-04-14	遊興費	FOD	1320
2040	2026-05	2026-05-27	164541	2026-04-15	支払い	アーバンコーポレーション	24200
2041	2026-05	2026-05-27	164541	2026-04-16	投資	投資	100000
2042	2026-05	2026-05-27	164541	2026-04-19	設備費	アドビ	1780
2043	2026-05	2026-05-27	164541	2026-04-20	設備費	マイクロソフト	2130
2044	2026-05	2026-05-27	164541	2026-04-23	遊興費	ユーチューブ	1280
2045	2026-05	2026-05-27	164541	2026-04-25	交通費	モバイルスイカ	10000
2046	2026-05	2026-05-27	164541	2026-04-28	設備費	さくらインターネット	1925
2047	2026-05	2026-05-27	164541	2026-04-28	設備費	グーグルプレイアップ	290
2033	2026-05	2026-05-27	164541	2026-03-31	雑費	楽天市場	1380
2038	2026-05	2026-05-27	164541	2026-04-09	遊興費	ABEMA	1180
2037	2026-05	2026-05-27	164541	2026-04-15	支払い	アーバンコーポレーション	7260
2036	2026-05	2026-05-27	164541	2026-04-12	交通費	モバイルスイカ	10000
2035	2026-05	2026-05-27	164541	2026-04-11	遊興費	Hulu	1026
2034	2026-05	2026-05-27	164541	2026-04-01	遊興費	アメトーーククラブ	770
";

        $ex_str = explode("\n", $str);

        $flag = true;
        foreach ($ex_str as $k => $v) {
            if (trim($v) == "") {
                continue;
            }

            $ex_v = explode("\t", trim($v));

            list($year, $month) = explode("-", trim($ex_v[1]));

            if($flag){
                DB::table('t_credit_summary')->where('year', '=', $year)->where('month', '=', $month)->delete();
                $flag = false;
            }

$subscription = (isset($subscriptionItems[trim($ex_v[6])]))? 1:0;

            $insert = [
                "year" => $year,
                "month" => $month,

                "use_date" => trim($ex_v[4]),
                "item" => trim($ex_v[5]),
                "detail" => trim($ex_v[6]),
                "price" => trim($ex_v[7]),
                "subscription" => $subscription
            ];

print_r($insert);
echo "\n\n";

            DB::table('t_credit_summary')->insert($insert);
        }

    }
}
