<?php

namespace App\Console\Commands;

use DB;
use Illuminate\Console\Command;

class CreditSummaryInsert extends Command
{

    protected $signature = 'CreditSummaryInsert';

    protected $description = 'Command description';

    public function handle()
    {

//===============================================//
$str2 = "
1	アメトーーククラブ
2	ソフトバンク
3	マイクロソフト
4	任天堂
5	テラサ
6	AWS
7	Hulu
8	FOD
9	ABEMA
10	投資
11	グーグルクラウド
12	アドビ
14	さくらインターネット
15	グーグルプレイアップ
16	テレビ東京
17	ドコモ
18	東京電力
19	NTTコミュニケーション
20	ユーネクスト
21	データ便
22	ネットフリックス
23	paddle
24	パラビ
25	エイワスポーツジム
26	chatgpt
27	アーバンコーポレーション
28	ユーチューブ
29	NTTドコモビジネス
30	chatgpt
";


$ex_str2 = explode("\n", $str2);

$subscriptionItems = [];

foreach ($ex_str2 as $k2 => $v2) {
    if (trim($v2) == "") {
        continue;
    }

    $ex_v2 = explode("\t", trim($v2));

    $subscriptionItems[trim($ex_v2[1])] = "";
}

//===============================================//



$str = "
1728	2026-03	2026-03-05	4806	2026-02-01	不明	MONGODB	1287
1729	2026-03	2026-03-05	4806	2026-01-29	設備費	クラウドコード	3185
1730	2026-03	2026-03-05	4806	2026-01-26	不明	NTTドコモビジネス	334
1865	2026-03	2026-03-26	15078	2026-02-22	雑費	アマゾン	1348
1858	2026-03	2026-03-26	15078	2026-02-07	雑費	アマゾン	1115
1859	2026-03	2026-03-26	15078	2026-02-11	雑費	アマゾン	398
1860	2026-03	2026-03-26	15078	2026-02-14	雑費	アマゾン	1299
1861	2026-03	2026-03-26	15078	2026-02-19	雑費	アマゾン	1188
1862	2026-03	2026-03-26	15078	2026-02-20	雑費	アマゾン	1446
1863	2026-03	2026-03-26	15078	2026-02-01	雑費	アマゾン	2189
1864	2026-03	2026-03-26	15078	2026-02-26	雑費	アマゾン	3399
1866	2026-03	2026-03-26	15078	2026-02-24	雑費	アマゾン	2696
1758	2026-03	2026-03-27	30749	2026-02-07	楽天キャッシュ	楽天キャッシュ	4115
1759	2026-03	2026-03-27	30749	2026-02-14	楽天キャッシュ	楽天キャッシュ	15667
1760	2026-03	2026-03-27	30749	2026-02-15	楽天キャッシュ	楽天キャッシュ	6793
1757	2026-03	2026-03-27	30749	2026-02-01	楽天キャッシュ	楽天キャッシュ	4174
1918	2026-03	2026-03-27	22546	2026-01-31	通信費	ソフトバンク	4161
1917	2026-03	2026-03-27	22546	2026-02-08	ふるさと納税	ふるさと納税	11804
1916	2026-03	2026-03-27	22546	2026-02-08	雑費	TEMU	5541
1915	2026-03	2026-03-27	22546	2026-01-31	通信費	ソフトバンク	1040
1893	2026-03	2026-03-27	141017	2026-02-28	交通費	モバイルスイカ	10000
1879	2026-03	2026-03-27	141017	2026-02-01	遊興費	アメトーーククラブ	770
1883	2026-03	2026-03-27	141017	2026-02-15	支払い	アーバンコーポレーション	7260
1884	2026-03	2026-03-27	141017	2026-02-15	遊興費	ネットフリックス	1590
1885	2026-03	2026-03-27	141017	2026-02-16	投資	投資	100000
1886	2026-03	2026-03-27	141017	2026-02-19	設備費	アドビ	1780
1887	2026-03	2026-03-27	141017	2026-02-11	遊興費	Hulu	1026
1888	2026-03	2026-03-27	141017	2026-02-21	教育費	UDEMY	1500
1889	2026-03	2026-03-27	141017	2026-02-23	設備費	グーグルプレイコンテンツ	1280
1890	2026-03	2026-03-27	141017	2026-02-25	教育費	UDEMY	1500
1891	2026-03	2026-03-27	141017	2026-02-26	教育費	UDEMY	1500
1892	2026-03	2026-03-27	141017	2026-02-27	設備費	さくらインターネット	1925
1877	2026-03	2026-03-27	141017	2026-02-14	遊興費	FOD	1320
1894	2026-03	2026-03-27	141017	2026-02-28	設備費	chatgpt	3576
1895	2026-03	2026-03-27	141017	2026-02-28	設備費	グーグルプレイアップ	290
1878	2026-03	2026-03-27	141017	2026-02-01	遊興費	テラサ	990
1882	2026-03	2026-03-27	141017	2026-02-14	教育費	UDEMY	1500
1880	2026-03	2026-03-27	141017	2026-02-09	遊興費	ABEMA	1080
1881	2026-03	2026-03-27	141017	2026-02-20	設備費	マイクロソフト	2130
";

        $ex_str = explode("\n", $str);

        $flag = true;
        foreach ($ex_str as $k => $v) {
            if (trim($v) == "") {
                continue;
            }

            $ex_v = explode("\t", trim($v));

            list($year, $month) = explode("-", trim($ex_v[1]));

            if($flag){
                DB::table('t_credit_summary')->where('year', '=', $year)->where('month', '=', $month)->delete();
                $flag = false;
            }

$subscription = (isset($subscriptionItems[trim($ex_v[6])]))? 1:0;

            $insert = [
                "year" => $year,
                "month" => $month,

                "use_date" => trim($ex_v[4]),
                "item" => trim($ex_v[5]),
                "detail" => trim($ex_v[6]),
                "price" => trim($ex_v[7]),
                "subscription" => $subscription
            ];

print_r($insert);
echo "\n\n";

            DB::table('t_credit_summary')->insert($insert);
        }

    }
}
