<?php

namespace App\Console\Commands;

use DB;
use Illuminate\Console\Command;

class CreditSummaryInsert extends Command
{

    protected $signature = 'CreditSummaryInsert';

    protected $description = 'Command description';

    public function handle()
    {

//===============================================//
$str2 = "
1	アメトーーククラブ
2	ソフトバンク
3	マイクロソフト
4	任天堂
5	テラサ
6	AWS
7	Hulu
8	FOD
9	ABEMA
10	投資
11	グーグルクラウド
12	アドビ
14	さくらインターネット
15	グーグルプレイアップ
16	テレビ東京
17	ドコモ
18	東京電力
19	NTTコミュニケーション
20	ユーネクスト
21	データ便
22	ネットフリックス
23	paddle
24	パラビ
25	エイワスポーツジム
26	chatgpt
27	アーバンコーポレーション
28	ユーチューブ
29	NTTドコモビジネス
30	chatgpt
";


$ex_str2 = explode("\n", $str2);

$subscriptionItems = [];

foreach ($ex_str2 as $k2 => $v2) {
    if (trim($v2) == "") {
        continue;
    }

    $ex_v2 = explode("\t", trim($v2));

    $subscriptionItems[trim($ex_v2[1])] = "";
}

//===============================================//



$str = "
1920	2026-04	2026-04-06	7458	2026-02-28	設備費	クラウドコード	3239
1921	2026-04	2026-04-06	7458	2026-03-03	不明	MONGODB	1191
1922	2026-04	2026-04-06	7458	2026-04-06	雑費	カード年会費	1320
1923	2026-04	2026-04-06	7458	2026-04-06	雑費	カード年会費	1375
1919	2026-04	2026-04-06	7458	2026-02-26	不明	NTTドコモビジネス	333
1992	2026-04	2026-04-27	57562	2026-03-17	楽天キャッシュ	楽天キャッシュ	7968
1998	2026-04	2026-04-27	57562	2026-03-22	楽天キャッシュ	楽天キャッシュ	3020
1997	2026-04	2026-04-27	57562	2026-03-14	楽天キャッシュ	楽天キャッシュ	26667
1996	2026-04	2026-04-27	57562	2026-03-09	楽天キャッシュ	楽天キャッシュ	1364
1995	2026-04	2026-04-27	57562	2026-03-05	楽天キャッシュ	楽天キャッシュ	6191
1994	2026-04	2026-04-27	57562	2026-02-27	楽天キャッシュ	楽天キャッシュ	5673
1993	2026-04	2026-04-27	57562	2026-03-25	楽天キャッシュ	楽天キャッシュ	6679
2006	2026-04	2026-04-27	17042	2026-03-28	雑費	アマゾン	5600
2005	2026-04	2026-04-27	17042	2026-03-27	雑費	アマゾン	1145
2004	2026-04	2026-04-27	17042	2026-03-22	雑費	アマゾン	1227
2003	2026-04	2026-04-27	17042	2026-03-16	雑費	アマゾン	2000
2002	2026-04	2026-04-27	17042	2026-03-11	雑費	アマゾン	1980
2001	2026-04	2026-04-27	17042	2026-03-09	雑費	アマゾン	799
2000	2026-04	2026-04-27	17042	2026-03-07	雑費	アマゾン	2102
1999	2026-04	2026-04-27	17042	2026-03-01	遊興費	ユーネクスト	2189
1986	2026-04	2026-04-27	134075	2026-03-09	遊興費	ABEMA	1080
1991	2026-04	2026-04-27	134075	2026-03-28	設備費	グーグルプレイアップ	290
1990	2026-04	2026-04-27	134075	2026-03-31	設備費	chatgpt	3624
1989	2026-04	2026-04-27	134075	2026-03-30	交通費	モバイルスイカ	10000
1988	2026-04	2026-04-27	134075	2026-03-28	設備費	さくらインターネット	1925
1987	2026-04	2026-04-27	134075	2026-03-23	遊興費	ユーチューブ	1280
1985	2026-04	2026-04-27	134075	2026-03-19	設備費	アドビ	1780
1984	2026-04	2026-04-27	134075	2026-03-16	投資	投資	100000
1983	2026-04	2026-04-27	134075	2026-03-15	遊興費	ネットフリックス	1590
1982	2026-04	2026-04-27	134075	2026-03-11	遊興費	Hulu	1026
1981	2026-04	2026-04-27	134075	2026-03-20	設備費	マイクロソフト	2130
1980	2026-04	2026-04-27	134075	2026-03-15	支払い	アーバンコーポレーション	7260
1979	2026-04	2026-04-27	134075	2026-03-14	遊興費	FOD	1320
1978	2026-04	2026-04-27	134075	2026-03-01	遊興費	アメトーーククラブ	770
2007	2026-04	2026-04-27	12980	2026-03-24	雑費	TEMU	6327
2008	2026-04	2026-04-27	12980	2026-02-28	通信費	ソフトバンク	1040
2009	2026-04	2026-04-27	12980	2026-02-28	通信費	ソフトバンク	5613
";

        $ex_str = explode("\n", $str);

        $flag = true;
        foreach ($ex_str as $k => $v) {
            if (trim($v) == "") {
                continue;
            }

            $ex_v = explode("\t", trim($v));

            list($year, $month) = explode("-", trim($ex_v[1]));

            if($flag){
                DB::table('t_credit_summary')->where('year', '=', $year)->where('month', '=', $month)->delete();
                $flag = false;
            }

$subscription = (isset($subscriptionItems[trim($ex_v[6])]))? 1:0;

            $insert = [
                "year" => $year,
                "month" => $month,

                "use_date" => trim($ex_v[4]),
                "item" => trim($ex_v[5]),
                "detail" => trim($ex_v[6]),
                "price" => trim($ex_v[7]),
                "subscription" => $subscription
            ];

print_r($insert);
echo "\n\n";

            DB::table('t_credit_summary')->insert($insert);
        }

    }
}
